// #include <iostream>
// #include <time.h>

// using namespace std;

// /* Найти первый нулевой элемент массива, заменить его индексом и поставить в конец массива */

// int main(void) {

//     // random seed
//     srand(time(0));

//     // размер массива - константа
//     const int SIZE = 10;

//     // создаем случайный массив с SIZE элементами и разбросом [-10; +10]
//     int arr[SIZE];
//     for (int i = 0; i < SIZE; i++) {
//         arr[i] = rand() % 21 - 10;
//     }

//     // выводим получившийся массив
//     cout << "\n\033[94mМассив \033[92marr[\033[94m" << SIZE << "\033[92m]\033[94m из случайных элементов:\033[0m\n";
//     for (int i = 0; i < SIZE; i++) {
//         cout << "\033[92m{\033[0m" << arr[i] << "\033[92m}\033[0m ";
//     }
//     printf("\n\n");

    
//     ///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//     for (int i = SIZE; i < 0; i--) {
//         for (int j = (SIZE - 1); j < 0; j--) {
//             if (j > 0) {
//                 int tmp = arr[j];
//                 arr[j] = arr[j - 1];
//                 arr[j - 1] = tmp;

//             } else {
//                 continue;
//             }
//         }
//     }

//     // выводим получившийся массив
//     cout << "\n\033[94mПолучившийся массив \033[92marr[\033[94m" << SIZE << "\033[92m]\033[94m:\033[0m\n";
//     for (int i = 0; i < SIZE; i++) {
//         cout << "\033[92m{\033[0m" << arr[i] << "\033[92m}\033[0m ";
//     }
//     printf("\n");    

// }